# Problem Statement:
-The Goal is to predict whether a person has an income of more than 50K a year or not.
This is basically a binary classification problem where a person is classified into the >50K group or <=50K group.

## Data Collection
- Dataset Source: https://www.kaggle.com/datasets/overload10/adult-census-dataset

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">1. EDA for Adult Income Dataset</p>

 ## Import Data and Required Packages

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

#### Import the CSV Data as Pandas DataFrame

In [2]:
df = pd.read_csv('data/income.csv')

In [3]:
#Show Top 10 Records
df.head(10)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K

In [4]:
#Shape of dataset
df.shape

(32561, 15)

## Dataset information

_The dataset provides 14 input variables that are a mixture of categorical, ordinal, and numerical data types. The complete list of variables is as follows:

   - Age.
   - Workclass.
   - Final Weight.
   - Education.
   - Education Number of Years.
   - Marital-status.
   - Occupation.
   - Relationship.
   - Race.
   - Sex.
   - Capital-gain.
   - Capital-loss.
   - Hours-per-week.
   - country.

### Check Missing values

In [5]:
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
country           0
salary            0
dtype: int64

#### Check Duplicates

In [6]:
df.duplicated().sum()

24

In [7]:
df.drop_duplicates()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [8]:
# Check Null and Dtypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  country         32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

### Checking the number of unique values of each column

In [9]:
df.nunique()

age                  73
workclass             9
fnlwgt            21648
education            16
education-num        16
marital-status        7
occupation           15
relationship          6
race                  5
sex                   2
capital-gain        119
capital-loss         92
hours-per-week       94
country              42
salary                2
dtype: int64

### Check statistics of data set

In [10]:
df.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

1. There's no missing data as all counts are same.
2. There is presence of outliers in the dataset in various columns.
3. There data has skewness too.

### Distinct column values

In [11]:
for i in df.columns:
    print(i, ':\n', df[i].unique())

age :
 [39 50 38 53 28 37 49 52 31 42 30 23 32 40 34 25 43 54 35 59 56 19 20 45
 22 48 21 24 57 44 41 29 18 47 46 36 79 27 67 33 76 17 55 61 70 64 71 68
 66 51 58 26 60 90 75 65 77 62 63 80 72 74 69 73 81 78 88 82 83 84 85 86
 87]
workclass :
 [' State-gov' ' Self-emp-not-inc' ' Private' ' Federal-gov' ' Local-gov'
 ' ?' ' Self-emp-inc' ' Without-pay' ' Never-worked']
fnlwgt :
 [ 77516  83311 215646 ...  34066  84661 257302]
education :
 [' Bachelors' ' HS-grad' ' 11th' ' Masters' ' 9th' ' Some-college'
 ' Assoc-acdm' ' Assoc-voc' ' 7th-8th' ' Doctorate' ' Prof-school'
 ' 5th-6th' ' 10th' ' 1st-4th' ' Preschool' ' 12th']
education-num :
 [13  9  7 14  5 10 12 11  4 16 15  3  6  2  1  8]
marital-status :
 [' Never-married' ' Married-civ-spouse' ' Divorced'
 ' Married-spouse-absent' ' Separated' ' Married-AF-spouse' ' Widowed']
occupation :
 [' Adm-clerical' ' Exec-managerial' ' Handlers-cleaners' ' Prof-specialty'
 ' Other-service' ' Sales' ' Craft-repair' ' Transport-moving'
 ' Farming-fishing' ' Machine-op-inspct' ' Tech-support' ' ?'
 ' Protective-serv' ' Armed-Forces' ' Priv-house-serv']
relationship :
 [' Not-in-family' ' Husband' ' Wife' ' Own-child' ' Unmarried'
 ' Other-relative']
race :
 [' White' ' Black' ' Asian-Pac-Islander' ' Amer-Indian-Eskimo' ' Other']
sex :
 [' Male' ' Female']
capital-gain :
 [ 2174     0 14084  5178  5013  2407 14344 15024  7688 34095  4064  4386
  7298  1409  3674  1055  3464  2050  2176   594 20051  6849  4101  1111
  8614  3411  2597 25236  4650  9386  2463  3103 10605  2964  3325  2580
  3471  4865 99999  6514  1471  2329  2105  2885 25124 10520  2202  2961
 27828  6767  2228  1506 13550  2635  5556  4787  3781  3137  3818  3942
   914   401  2829  2977  4934  2062  2354  5455 15020  1424  3273 22040
  4416  3908 10566   991  4931  1086  7430  6497   114  7896  2346  3418
  3432  2907  1151  2414  2290 15831 41310  4508  2538  3456  6418  1848
  3887  5721  9562  1455  2036  1831 11678  2936  2993  7443  6360  1797
  1173  4687  6723  2009  6097  2653  1639 18481  7978  2387  5060]
capital-loss :
 [   0 2042 1408 1902 1573 1887 1719 1762 1564 2179 1816 1980 1977 1876
 1340 2206 1741 1485 2339 2415 1380 1721 2051 2377 1669 2352 1672  653
 2392 1504 2001 1590 1651 1628 1848 1740 2002 1579 2258 1602  419 2547
 2174 2205 1726 2444 1138 2238  625  213 1539  880 1668 1092 1594 3004
 2231 1844  810 2824 2559 2057 1974  974 2149 1825 1735 1258 2129 2603
 2282  323 4356 2246 1617 1648 2489 3770 1755 3683 2267 2080 2457  155
 3900 2201 1944 2467 2163 2754 2472 1411]
hours-per-week :
 [40 13 16 45 50 80 30 35 60 20 52 44 15 25 38 43 55 48 58 32 70  2 22 56
 41 28 36 24 46 42 12 65  1 10 34 75 98 33 54  8  6 64 19 18 72  5  9 47
 37 21 26 14  4 59  7 99 53 39 62 57 78 90 66 11 49 84  3 17 68 27 85 31
 51 77 63 23 87 88 73 89 97 94 29 96 67 82 86 91 81 76 92 61 74 95]
country :
 [' United-States' ' Cuba' ' Jamaica' ' India' ' ?' ' Mexico' ' South'
 ' Puerto-Rico' ' Honduras' ' England' ' Canada' ' Germany' ' Iran'
 ' Philippines' ' Italy' ' Poland' ' Columbia' ' Cambodia' ' Thailand'
 ' Ecuador' ' Laos' ' Taiwan' ' Haiti' ' Portugal' ' Dominican-Republic'
 ' El-Salvador' ' France' ' Guatemala' ' China' ' Japan' ' Yugoslavia'
 ' Peru' ' Outlying-US(Guam-USVI-etc)' ' Scotland' ' Trinadad&Tobago'
 ' Greece' ' Nicaragua' ' Vietnam' ' Hong' ' Ireland' ' Hungary'
 ' Holand-Netherlands']
salary :
 [' <=50K' ' >50K']

- We can observe that the workclass,occupation & country column has '?' values which means none.

### Amount of wrong column values in the dataset.

In [12]:
for i,j in zip(df.columns,(df.values.astype(str) == ' ?').sum(axis = 0)):
    if j > 0:
        print(str(i) + ': ' + str(j) + ' records')

workclass: 1836 records
occupation: 1843 records
country: 583 records

In [13]:
df = pd.read_csv('data/income.csv',na_values=[" ?"])

In [14]:
df.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education-num        0
marital-status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
country            583
salary               0
dtype: int64

In [15]:
df["occupation"] = df["occupation"].fillna(df["occupation"].mode()[0])
df["workclass"] = df["workclass"].fillna(df["workclass"].mode()[0])
df["country"] = df["country"].fillna(df["country"].mode()[0])

In [16]:
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
country           0
salary            0
dtype: int64

### Exploring Data

In [17]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [18]:
#Checking correlation

sns.heatmap(df.corr())

ValueError: could not convert string to float: ' Bachelors'

In [ ]:
print("Categories in 'workclass' variable:     ",end=" " )
print(df['workclass'].unique())

print("Categories in 'education' variable:     ",end=" " )
print(df['education'].unique())

print("Categories in 'occupation' variable:     ",end=" " )
print(df['occupation'].unique())

print("Categories in 'marital Status' variable:     ",end=" " )
print(df['occupation'].unique())

print("Categories in 'race' variable:     ",end=" " )
print(df['race'].unique())

:

In [ ]:
# define numerical & categorical columns
numeric_features = [feature for feature in df.columns if df[feature].dtype != 'O']
categorical_features = [feature for feature in df.columns if df[feature].dtype == 'O']

# print columns
print('We have {} numerical features : {}'.format(len(numeric_features), numeric_features))
print('\nWe have {} categorical features : {}'.format(len(categorical_features), categorical_features))

:

#### Frequency distribution of 'Salary status'

In [ ]:
SalStat = sns.countplot(x=df['salary'])

:

- 75 % of people's salary status is <=50,000  & 25% of people's salary status is > 50,000
- Data is imbalanced

### Exploring Data ( Visualization )

In [ ]:
##Histogram of Age
sns.displot(df['age'],bins=10,kde=True)

:

- People with age 20-45 age are high in frequency

### Box Plot - Age vs Salary status

In [ ]:
sns.boxplot(x='salary',y='age',data=df)
df.groupby('salary')['age'].median()

:

- People with 35-50 age are more likely to earn > 50000 USD p.a
- People with 25-35 age are more likely to earn <= 50000 USD p.a

In [ ]:
crosstb = pd.crosstab(df.age, df.salary)
barplot = crosstb.plot.bar(rot=0,figsize = (15,6))
plt.xticks(rotation = 90)
plt.show()

:

1. We infer that **min** salary of most of the population is in their 20's which is a valid as it is the starting time of a career
2. **Age** and **Salary** are in direct proportion with each other.
3. The data is left skewed as there are a very few people who work after 60's,therefore,the chances of salary being more than 50k is very less.

### Ocuupation

In [ ]:
Occupation     = sns.countplot(y=df['occupation'],hue = 'salary', data=df)
Occupation_salstat =pd.crosstab(index = df["occupation"],columns = df['salary'], margins = True, normalize =  'index')  
round(Occupation_salstat*100,1)

:

- Population is distributed in all of the occupational fields with minimum in armed forces & maximum in prof-speciality.
- Being in an executive managerial position gives almost equal chances of getiing a <= or > 50k salary.
- Being a prof-Specialty and executive managerial there is high chance of earning >50K as compared to other fields

### Education

In [ ]:
Education   = sns.countplot(y=df['education'],hue = 'salary', data=df)
EdType_salstat = pd.crosstab(index = df["education"], columns = df['salary'],margins = True,normalize ='index')  
round(EdType_salstat*100,1)

:

We infer that the population is broadly divided into three groups:

   - Bachelors: A person having a bachelors degree has 60:40 chances of getting <= or > 50 k salary.
   - HS-grad: A person being a highschool graduate has 95:05 chances of getting <= or > 50 k salary. As most of the population is concentrated in highschool passout this reflects that most of the people do not cotinue their studies after school.
   - Some-college: A person attended a college but has no degree is certainly likely to have 75:25 chances of getting <= or > 50 k salary. Surprisingly their are good number of people in this category which is a huge liability to the county and the person itself as they're not getting jobs according to their capabilites.

Another noticable thing is that only a very few pople complete their masters but one with that degree have a 45:55 chance of getting <= or > 50 k salary.

### WorkClass

In [ ]:
Workclass   = sns.countplot(y=df['workclass'],hue = 'salary', data=df)
Workclass_salstat = pd.crosstab(index = df["workclass"], columns = df['salary'],margins = True,normalize ='index')  
round(Workclass_salstat*100,1)

:

1. We infer that salary of most of the population be it <= or > 50k is occupied by the Private sector.
2.    Only a very few people belonging to private sector have a salary >50k, but it is still more than the sum total of all other sectors recieving salary >50k.
3.    A self-employed person that is a buisnessman has slighlty more chances of getting >50k salary.

### Country

In [ ]:
Country_salstat = pd.crosstab(index = df["country"], columns = df['salary'],margins = True,normalize ='index')  
round(Country_salstat*100,1)

:

In [ ]:
crosstb = pd.crosstab(df.country, df.salary)
barplot = crosstb.plot.bar(rot=0,figsize = (15,6))
plt.xticks(rotation = 90)
plt.show()

:

The only country having max population is United-States where 75:25 is the chance of getting <= or > 50 k salary.

### Capital_Gain and Capital loss

In [ ]:
sns.distplot(df['capital-gain'], bins = 10, kde = True)

:

In [ ]:
sns.distplot(df['capital-loss'], bins = 10, kde = True)

:

 ### Race & Salary

In [ ]:
crosstb = pd.crosstab(df.race, df.salary)
barplot = crosstb.plot.bar(rot=0,figsize = (15,6))

:

- Most of the population is white and has 75:25 chance of getting <= or > 50 k salary.

### Hours Per Week & Salary

In [ ]:
crosstb = pd.crosstab(df["hours-per-week"], df.salary)
barplot = crosstb.plot.bar(rot=0,figsize=(15,6))
plt.xticks(rotation = 90)
plt.show()

:

Most of the people work for 40 hours per week

### Marital Status & Salary

In [ ]:
crosstb = pd.crosstab(df["marital-status"], df.salary)
barplot = crosstb.plot.bar(rot=0,figsize = (15,6))

:

We infer that the population is broadly divided into three groups:

   1. Divorced: A divorced person has 90:10 chances of getting <= or > 50 k salary.
   2. Married-civ-spouse: A person married to a civillian spouse has 53:47 chances of getting <= or > 50 k salary. People in this domain are almost equal in number.
   3. Never-married: A person who has never married has 95:05 chances of getting <= or > 50 k salary. Most of the population is concentrated in this domain. ​ 

Another noticable thing is that people who marry a spouse in armed forcues have and equal chance of getting <= or > 50 k salary.

### Education number,Race & Salary

In [ ]:
sns.displot(data=df, x=df["education-num"], hue=df["race"], col=df["salary"], kind="kde")

:

1. Most of the people who are white recieve education for around 9 years and get a salary of <=50 k.
2. Very few white people seem to get education for around 13 years and recieve a salary of >50 k.
3. All other races do not get that much education and therefore have low salary.

### Hours per week,relationship & Salary

In [ ]:
sns.displot(data=df, x=df["hours-per-week"], hue=df["relationship"], col=df["salary"], kind="kde")

:

1. Most of the people who are not in family work for around 40 hours per week and get a salary of <=50 k.
2. People who have a relationship of husband work for around 40 hours per week and recieve a salary of >50 k.